Revit 2027 API
BuiltInFailures.MEPCalculationFailures.Network_NotEnoughNodes Property
 The calculation could not be executed as configured. Specify at least 4 elements before analyzing this network.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId Network_NotEnoughNodes { get; }
Public Shared ReadOnly Property Network_NotEnoughNodes As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ Network_NotEnoughNodes {
	FailureDefinitionId^ get ();
}
static member Network_NotEnoughNodes : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace